STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Power_Central/STM32_WPAN/App/app_ble.c
void APP_BLE_Key_Button3_Action(void)
{
  
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    APP_DBG_MSG("  ** No device connected **\n");
  }
  else
  {
    APP_DBG_MSG("  ** CONNECTION UPDATE **\n");
    if(bleAppContext.ConnectionInterval_Level == CONN_INT_MS(CONN_INTERVAL))
    {
      bleAppContext.ConnectionInterval_Level = CONN_INT_MS(CONN_INTERVAL_LP);
    }
    else 
    {
      bleAppContext.ConnectionInterval_Level = CONN_INT_MS(CONN_INTERVAL);
    }
    
    aci_gap_start_connection_update(bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                             bleAppContext.ConnectionInterval_Level, 
                                             bleAppContext.ConnectionInterval_Level, 
                                             0, 0x3e8, 0x0000, 0x0280);
    
  }
  BleStackCB_Process();
  return;
}
                    

void Check_Button(void)
{
  uint8_t B1,B2,B3;
    if(PWR_CO_GPIO_Status == PWR_CO_GPIO_OFF)
  {
    return;
  }
  else
  {
   if (PWR_CO_GPIO_Status != PWR_CO_GPIO_OFF)
  {
    MX_GPIO_Init();
  }
  
    B1 = HAL_GPIO_ReadPin(B1_GPIO_Port,B1_Pin);
    B2 = HAL_GPIO_ReadPin(B2_GPIO_Port,B2_Pin);
    B3 = HAL_GPIO_ReadPin(B3_GPIO_Port,B3_Pin);
    
  if ((B1 != 1)&&(bleAppContext.B1_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_1, CFG_SEQ_PRIO_0);
    bleAppContext.B1_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B1 != 0)
  {
    bleAppContext.B1_Switch = 1;
  }  
     if ((B2 != 1)&&(bleAppContext.B2_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_2, CFG_SEQ_PRIO_0);
    bleAppContext.B2_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B2 != 0)
  {
    bleAppContext.B2_Switch = 1;
  }
  
  if ((B3 != 1)&&(bleAppContext.B3_Switch == 1))
  {    
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_3, CFG_SEQ_PRIO_0);
    bleAppContext.B3_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B3 != 0)
  {
    bleAppContext.B3_Switch = 1;
  }
  
  if (PWR_CO_GPIO_Status == PWR_CO_GPIO_TIM_RESET_ON)
  {
    UTIL_TIMER_Stop(&bleAppContext.DISABLE_IOs);
    UTIL_TIMER_StartWithPeriod(&bleAppContext.DISABLE_IOs, Setup_Time);
    PWR_CO_GPIO_Status = PWR_CO_GPIO_ON;
  }
  }
}

void Disable_GPIOs(void)
{
  if(CFG_LPM_LEVEL > 1)
  {
    GPIO_InitTypeDef GPIO_InitStruct = {0};
  
    /*Put all GPIOs on analog*/
    
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Pin  = GPIO_PIN_All;
  
   HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
   HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
   HAL_GPIO_Init(GPIOC, &GPIO_InitStruct); 
   HAL_GPIO_Init(GPIOH, &GPIO_InitStruct); 
     
  __HAL_RCC_GPIOA_CLK_DISABLE();
  __HAL_RCC_GPIOB_CLK_DISABLE();
  __HAL_RCC_GPIOC_CLK_DISABLE();
  __HAL_RCC_GPIOH_CLK_DISABLE();

  PWR_CO_GPIO_Status = PWR_CO_GPIO_OFF;
  }

}

static void GPIO_Off_Req(void *arg)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_GPIO_OFF_ID, CFG_SEQ_PRIO_0);
  return;
}
/* USER CODE END FD_WRAP_FUNCTIONS */
